### Nonprimitive Data Type

### เจาะลึกการใช้ List

##############################################################################
# เขียนแบบ primitive
a = 1
a1 = 2
a2 = 3
a3 = 4
a4 = 5

print(a1+a4)
##############################################################################

##############################################################################
### เขียนแบบ non-primitive
### การสร้าง list

number = [] # list ว่าง เสมือนกล่องเปล่า

### ยัดข้อมูลเข้าไป
number=[1,2,3,4,5,6] # list มีสมาชิก 1,2
name=["นายD","นายE","นายF"] # การสร้าง list name มีสมาชิกเป็นข้อความ
all=[10,"นายไข่",True,3.142778,-10]

### ใช้ constructor ประกาศข้อมูลขึ้นมาเลย เหมือนแบบนี้จะดีกว่า
name = list(["นายA","นายB","นายC"])

##############################################################################

##############################################################################
### การเข้าถึงข้อมูล

# แสดงผลข้อมูลก่อนละกัน
print(name)
print(type(name))
print(all)
print(number)

## เข้าถึงข้อมูลของ list
print(number[0])
print(number[2])
print(number[4])
print(number[2]+number[1])

print(name[1])

print(all[3])

## ระบุค่า index จากค่าลบเป็นจากข้างหลังมาข้างหน้าได้
print(all[-3])

## ระบุแบบกำหนดช่วง
print(all[1:3+1])

print(all[-3:])
print(all[2:])
##############################################################################