### Assignment #1 เรียงลำดับตัวเลข

##############################################################################
## รับตัวเลข
## เรียงลำดับตัวเลข

number = list([])
while True: # ให้ทำงานตลอดเวลา
    x = int(input("ป้อนตัวเลขของคุณ : "))
    if x<0:
        break
    number.append(x)
    
print("list of number is => ",number)
print("End")

## เรียงลำดับตัวเลขโดยใช้ sort
print("ข้อมูลก่อนเรียงลำดับ => ",number)

number.sort()
print("ข้อมูลหลังเรียงลำดับ , จากน้อยไปมาก => ",number)

number.reverse()
print("ข้อมูลหลังเรียงลำดับ , จากมากไปน้อย => ",number)
print("End")
##############################################################################