### Assignment 2 : หาค่าตัวเลขต่ำลุด - สูงสุด  และผลรวมของตัวเลข
 
##############################################################################

number = list([])
while True: # ให้ทำงานตลอดเวลา
    x = int(input("ป้อนตัวเลขของคุณ : "))
    if x<0:
        break
    number.append(x)
    
print("list of number is => ",number)
print("End")

## หาค่าน้อยที่สุด และมากที่สุด
print("ค่าที่น้อยที่สุดคือ => ",min(number))
print("ค่าที่มากที่สุดคือ => ",max(number))
##############################################################################

##############################################################################
## อยากจะได้ผลรวมของตัวเลขสมาชิก ใน list number
print("ผลรวมคือ => ",sum(number))
##############################################################################