### Assignment 4 : เรียงลำดับชื่อ

##############################################################################
student = ["สมพร","แก้ว","จอมขวัญ","อัมพร","ก้อง","กล้า"]

print("ข้อมูล list student ก่อนการเรียงลำดับชื่อ => ",student)

student.sort()
print("ข้อมูล list student หลังการเรียงลำดับชื่อ , เรียงจากหลังไปหน้า => ",student)

student.reverse()
print("ข้อมูล list student หลังการเรียงลำดับชื่อ , เรียงจากหน้าไปหลัง => ",student)
##############################################################################