### Tuple

##############################################################################
## Tuple is inmutable คือไม่สามารถเปลี่ยนแปลงได้

### การนิยาม 
tup = (1,2,3,4,"๋JohnTik","มะม่วง",True,3.99) # tuple
print("tup => ",tup)
print(type(tup))

lis = [1,2,3,4,"๋JohnTik","มะม่วง",True,3.99]
print("lis => ",lis)
print(type(lis))
##############################################################################

##############################################################################
### constructor
tup_2 = tuple((1,2,3,4,"๋JohnTik","มะม่วง",True,3.99))
print("tup_2 => ",tup_2)
print(type(tup_2))

lis_2 = list([1,2,3,4,"๋JohnTik","มะม่วง",True,3.99])
print("lis_2 => ",lis_2)
print(type(lis_2))

### การเปลี่ยนสมาชิกให้เป็นตัวอื่น
lis_2[0] = "กรุงเทพ"
print("lis_2 หลังเปลี่ยนแปลงข้อมูล => ",lis_2)

'''
## มันจะ Error นะ เพราะมันเปลี่ยนแปลงไม่ได้

tup[0] = "ชลบุรี"
print("tup_2 หลังเปลี่ยนแปลงข้อมูล => ",tup_2)
'''

##############################################################################