### การนับจำนวนสมาชิก

##############################################################################
### การใช้ len
tup = (1,2,3,4,"JohnTik","มะม่วง",True,3.99) # tuple
print("tup => ",tup)

# index จะนับตำแหน่งที่ 0-7
# len นับตั้งแต่ 1 - 8 จะเป็น 8 ตัว
print("tup มีสมาชิกจำนวน => ",len(tup),"ตัว")

##############################################################################

##############################################################################
### การใช้ len ร่วมกันกับ loop for

for item in range(len(tup)): # 0 ไปถึง 7
    print(tup[item]) # tup[0] - tup[7]

##############################################################################
