### Tuple

##############################################################################
### การสร้างและเพิ่มข้อมูล

tup = (1,2,3,4,"JohnTik","มะม่วง",True,3.99) # tuple
print("tup => ",tup)

x = tuple()
print(x)
print(type(x))

y = ("JohnTik",)
print(y)
print(type(y))

##############################################################################

##############################################################################
### การเพิ่มข้อมูล
name = ("JohnTik","Jojo")
new = "Odegaard"
print(type(name))
print(type(new))

name = name + (new,)
print(name)
##############################################################################




