### Tuple

##############################################################################
## การนำค่า tuple => ตัวแปร
tup = (10,20,30)
a,b,c = tup
print("ค่าของตัวแปร a คือ =>",a)
print("ค่าของตัวแปร b คือ =>",b)
print("ค่าของตัวแปร c คือ =>",c)

d = a + c
print("ค่าของตัวแปร d คือ =>",c)
##############################################################################

##############################################################################
## การสลับ tuple 
x = (50,60)
y = (88,99)

x,y = y,x
print("ค่าของตัวแปร x หลังสลับ tuple คือ =>",x)
print("ค่าของตัวแปร y หลังสลับ tuple คือ =>",y)
##############################################################################

##############################################################################
## แปลง tuple ให้กลายเป็น String
character = ('k','o','n','g')

# ใช้ funcition join
character = "".join(character)
print("character หลัง join => ",character)

##############################################################################

##############################################################################
### reverse tuple
x = (100,20,30,15,10,5,500)
print("x => ",x)

x = reversed(x)
print("x หลัง reverse => ",x)
# มันเป็น object ต้องแปลงกลับมาเป็น tuple ก่อน
x = tuple(x)
print("x หลังเปลี่ยนกลับมาเป็น tuple => ",x)
##############################################################################

##############################################################################
### string to tuple และสลับจากหลังมาข้างหน้า
x = "JohnTik"
print("x => ",x)

x = reversed(x)
print("x หลัง reverse => ",x)
# มันเป็น object ต้องแปลงกลับมาเป็น tuple ก่อน
x = tuple(x)
print("x หลังเปลี่ยนกลับมาเป็น tuple => ",x)
##############################################################################
