### SET

##############################################################################
## การดึงข้อมูลสมาชิกโดยใช้ loop for
pet = {"หมา","แมว","นก","ลิง","กระต่าย","กระรอก"}
print("pet => ",pet)

for item in pet:
    print("สมาชิกของ Set => ",item)

print("End")

##############################################################################

##############################################################################
### การนับจำนวนสมาชิก โดยการใช้ len
for item in pet:
    print("สมาชิกของ Set => ",item)

print("จำนวนของสมาชิก => ",len(pet),"ตัว")
print("End")

if "เต่า" in pet:
    print("เป็นสมาชิก")
else :
    print("ไม่เป็นสมาชิก")

print("เป็นสมาชิก") if "แมวน้ำ" in pet else print("ไม่เป็นสมาชิก")

if "เต่า" not in pet:
    print("ใช่")
else :
    print("ไม่ใช่")

##############################################################################

##############################################################################
### การลบข้อมูล คือ remove,discard
pet.remove("ลิง")
print("pet หลังการใช้ remove => ",pet)

### ถ้าใช้ remove แล้วมันไม่อยู่ใน SET มันจะ Error
### ถ้าใช้ discard พอใช้แล้ว มันจะไม่ ERROR
pet.discard("แมวน้ำ")
print("pet หลังการใช้ discard => ",pet)

pet.discard("กระรอก")
print("pet หลังการใช้ discard => ",pet)

pet.add("กระรอก")
print("pet เผลอลบไปเพิ่มเข้าไปใหม่ => ",pet)

### การล้าง stock คือล้างทั้งหมด
### ใช้คำสั่ง clear
# del pet # ลบ pet ทิ้งเลย
# print("pet เผลอลบไปเพิ่มเข้าไปใหม่ => ",pet) # มันจะ Error เพราะเราได้ลบไปแล้ว

### ใช้คำสั่ง clear
pet.clear()
print("pet หลังใช้ clear => ",pet) ## จะได้ set ที่ว่างเปล่า

##############################################################################