### Dictionary

##############################################################################
## วิธีการแก้ไขข้อมูล
colors = dict({"red":"สีแดง","yellow":"สีเหลือง","green":"สีเขียว",98:"บ้านแสนสุข",100:"บ้านป่า",True:"โสด",False:"แต่งงานแล้ว"})
print("colors ก่อนการแก้ คือ => ",colors)

colors[100] = "บ้านสวน"
print("colors หลังการแก้ คือ => ",colors)

##############################################################################

##############################################################################
# การเพิ่มข้อมูล
colors.update({"blue":"สีน้ำเงิน"})
colors.update({"orange":"สีส้ม"})
## เพิ่มมากกว่า 1 ได้
colors.update({"black":"สีดำ","salmon":"สีส้มแซลมอน"})
print("colors หลังการเพิ่มข้อมูลโดยการใช้ update => ",colors)

# ถ้า key มันซ้ำกัน มันจะบอกว่ามันแก้ไขทับ
colors.update({"black":"สีดำ","salmon":"สีส้มแซลมอน","red":"สีชมพู"})
print("colors หลังการเพิ่มข้อมูลโดยการใช้ update => ",colors)
##############################################################################