### Nested Dictionary

##############################################################################
## การใช้ Dictionary ซ้อนกัน หรือ Nested Dictionary

market = {
    "ร้านป้าพร": "อาหารตามสั่ง",
    "ร้านลุงป้อม": "รถถัง",
    "ร้านลุงตู่": "เรือดำน้ำ"
}

print("market => ",market)

market_A = {
    "ร้านป้าพร":{
        "host": "ป้าพร",
        "menu": ["กะเพราไก่","ก๋วยเตี๋ยว"],
        "zone": "west"
    },
    "ร้านลุงป้อม":{
        "host": "น้าหนู",
        "menu": ["รถถัง","เครื่องบินขับไล่"],
        "zone": "ข้างๆตู่"
    },
    "ร้านลุงตู๋":{
        "host": "ลุงตู่",
        "menu": ["เรือดำน้ำ","โพเดี้ยม"],
        "zone": "ข้างๆป้อม"
    }
}

print("market A => ",market_A)
print("menu ร้านป้าพร => ",market_A["ร้านป้าพร"]["menu"])

print("Yes") if "ก๋วยเตี๋ยว" in market_A["ร้านป้าพร"]["menu"] else print("No")
##############################################################################