### Function

########################################################################################################################
# สาเหตุที่ต้องเขียนฟังก์ชัน
# 1. ลดการใช้คำสั่งที่ซ้ำกันหลายๆจุด

a,b,c,d = 10,23,40,50

if a%2 == 0 :
    print("เลขคู๋")
else:
    print("เลขคี่")

if b%2 == 0 :
    print("เลขคู๋")
else:
    print("เลขคี่")

if c%2 == 0 :
    print("เลขคู๋")
else:
    print("เลขคี่")

if d%2 == 0 :
    print("เลขคู๋")
else:
    print("เลขคี่")

########################################################################################################################


