### Global and local Variables

########################################################################################################################
def displayNumber():
    # แสดงค่าตัวเลข
    x = 50
    print("Hello => ",x,"ในฟังก์ชัน")

# โปรแกรมหลัก
x = 20
displayNumber()
print("Hello => ",x,"นอกฟังก์ชัน")

# ตัวแปรทำงานคนละที่ การเข้าถึงจะแตกต่างกัน
# Global Variable กับ Local Variable


# Global - ข้างนอกฟังก์ชัน



# Local - ข้างในฟังก์ชัน


########################################################################################################################