### Function

########################################################################################################################
## Argument Parameter

# Argument คือค่าที่ส่งไปใน Function
# Parameter คือค่าตัวแปรที่รับข้อมูลที่ส่งมาทำงาน ที่ส่งมาจาก Argument

def myData_A(a,b,c):
    print("ชื่อ => ",a,": นามสกุล =>",b,": อายุ => ",c)

name="สุเมธ"
lname="จุฑาจันทร์"
age=35

myData_A(name,lname,age)

print("END")



def addtition(a,b):
    print("ผลของ addition => ",a+b)

x = 20
y = 35

addtition(x,y)

########################################################################################################################