### Assignment 1

########################################################################################################################
## การหาเลขคู่ เลขคี่

def OddOrEven(number):
    if number % 2 == 0:
        print("เป็นเลขคู่")
    else:
        print("เป็นเลขคี่")
        
OddOrEven(15)
OddOrEven(20)

a,b,c,d = 10,23,40,50

OddOrEven(a)
OddOrEven(b)
OddOrEven(c)
OddOrEven(d)

# for i in range(1,50+1,1):
#     print(OddOrEven(i),i)
########################################################################################################################