### Return

########################################################################################################################
## สามารถ block ไม่ให้ทำได้ด้วย 
## ใส่ return เปล่่าๆ ได้เลย
 
def randomNumber(x):
    if len(x)<3:
        return # มันจะกระโดดออกจาก function นี้เลย หลังจากนี้มันจะไม่ทำงานเลย
    if x == '168':
        print("ถูกหวย")
        return 1000
    else:
        print("ไม่ถูกหวย")
        return 0

money = randomNumber("168")
print("เงินรางวัล => ",money)
print("End")

money = randomNumber("165")
print("เงินรางวัล => ",money)
print("End")
########################################################################################################################