### ฟังก์ชันเรียกฟังก์ชัน

########################################################################################################################
## ฟังก์ชันตัวเลขฐานสอง
########################################################################################################################
N = int(input("N => "))

def solution(N):
    bin_num = str(bin(N)[2:])
    bin_num = bin_num.rstrip('0')
    bin_num = bin_num.lstrip('0')
    list1 = bin_num.split('1')

    print("binary number is => ",bin_num)

    max_gap = 0

    for i in range(len(list1)):
        if len(list1[i]) > max_gap:
            max_gap = len(list1[i])

    return (max_gap)

print(solution(N))

########################################################################################################################

### Rotation Array

A = list([5,10,15,20,25,30])
K = 3

def solution_A(A , K):
     old_array = A
     new_array = [0]*len(A)
     for i in range(K):
         new_array[0]=old_array[-1]
         new_array[1:] = old_array[:-1]
         old_array = new_array.copy() # This was the problematic line
     return new_array

print(solution(A , K))

########################################################################################################################

########################################################################################################################


########################################################################################################################
