## Recursive Function

########################################################################################################################
## เข้า Loop ปวดหัว
# เรียก Function ของตัวเอง โดยมีการทำซ้ำไปเรื่อยๆ จะหาจุดวนกลับมาหาฟังก์ชันของตัวเอง

'''
หาจุดวนซ้ำ
หาจุดออกจาก function ต้องระบุ return ด้วย
ต้องมี parameter

1-5 โดยไม่ใช้ คำสั่ง loop
'''

# def a(): # มันจะวนซ้ำไปเรื่อยๆ ต้องหาจุดออกจาก function
#     print("A")
#     # b()
#     a()

# def b():
#     print("B")

# a()

# def b():
#     i=1
#     print(i)
#     i=i+1
#     b()

# b()


########################################################################################################################

# ไม่มี loop for กับ loop while เลย เราใช้ Recursive Function แทน
def addNumber(number):
    if number == 5: 
        return # ให้ return เป็นค่าว่างออกมา
    print(number+1)
    number=number+1
    addNumber(number)

addNumber(0)

########################################################################################################################


########################################################################################################################
# สร้าง function การบวกเลข
def summation(number):
    if number == 1:
        return number
    else :
        return number + summation(number -1)

x = summation(5) # ? = 5 + 4 + 3 + 2 + 1 
print("ผลรวมคือ => ",x)

'''
5
5 + summation(4)
5 + 4 + summation(3)
5 + 4 + 3 + summation(2)
5 + 4 + 3 + 2 + summation(1)
5 + 4 + 3 + 2 + 1
'''

########################################################################################################################