### เจาะลึกการใช้ List ต่อเนื่อง

##############################################################################
### การเพิ่มข้อมูล
number=[1,2,3,4,5,6,7,8,9,10] 
fruit=["มะม่วง","มะนาว","มะยม","มะละกอ"]

# เพิ่มผลไม้เข้าไปใน fruit
print("ก่อนเพิ่มข้อมูล => ",fruit)

# การเพิ่มโดยใช้ append คือการนำสมาชิกใหม่มาต่อท้ายสมาชิกเดิม
fruit.append("มะปราง")
fruit.append("แตงโม")
print("หลังเพิ่มข้อมูล => ",fruit)

##############################################################################

##############################################################################
# การ insert แทรกเพื่อนเข้าไป
### ให้มันอยู่ระหว่างตัวใดตัวนึง
### insert (index,สมาชิกใหม่)
fruit.insert(1,"ทุเรียน")
print("ข้อมูลหลังแทรกข้อมูล => ",fruit)
##############################################################################

##############################################################################
## การลบข้อมูลออกจาก list
# เราจะลบข้อมูลทิ้ง

### remove
fruit.remove("มะยม")
print("ข้อมูลหลังทำการลบข้อมูลด้วย remove =>",fruit)

### pop มันจะเอาตัวที่อยู่หลังสุดออกไป
fruit.pop()
print("ข้อมูลหลังทำการลบข้อมูลด้วย pop ครั้งที่ 1 =>",fruit)

fruit.pop()
print("ข้อมูลหลังทำการลบข้อมูลด้วย pop ครั้งที่ 2 =>",fruit)

### del ลบแต่ต้องระบุเป็นตัว index ## กรณีที่เรารู้ index ของข้อมูล
del fruit[1]
print("ข้อมูลหลังทำการลบข้อมูลด้วย del =>",fruit)

# del fruit # เคลียร์หน่วยความจำด้วย คือลบ fruit ออกไปเลย
# print(fruit) # มันจะ error เพราะถูกลบทิ้งไปแล้ว

### clear คือการล้างข้อมูลสมาชิกให้เหลือเป็น list เปล่าๆ
fruit.clear()
print("ข้อมูลหลังทำการลบข้อมูลด้วย clear =>",fruit)

##############################################################################