### Tower of Hanoi

########################################################################################################################
## 
'''
ืn = จำนวนจาน
เสา => A,B,C

ีมีจาน จำนวน 3 ใบ
n=1
n=2 (n-1)
n=3 (ใหญ่สุด)
'''

'''
A => 3 => C => ใหญ่ => เล็ก
B (จุดพักจาน)

A => ล ก ญ
A (ล ก) => B (ล ก)
A ญ => C

C => ล ก ญ
'''

def hanoi(n,a,b,c):
    # a => c
    if(n==0):
        return
    hanoi(n-1,a,c,b) # ย้าย a (ล,ก) => b | c จุดพัก , (ย้าย a, พัก c , ไป b)
    print("จานที่ = ", n, "จาก = ",a, " ไป = ",c)
    hanoi(n-1,b,a,c)

hanoi(3,"A","B","C")




########################################################################################################################