### การรวมข้อมูล

##############################################################################
### เอาข้อมูลอีก list นึง ไปใส่อีก list นึง
number=[1,2,3,4,5,6,7,8,9,10] 
fruit=["มะม่วง","มะนาว","มะยม","มะละกอ"]

### เอา number กับ fruit มารวมร่างกัน
### ใช้ + ในการ concat กัน
allGroup = number + fruit
print("allGroup => ",allGroup)

### การใช้ extend โดยที่ไม่ต้องสร้าง allgroup เหมือนอันข้างบน
number.extend(fruit)
print("number => ",number)
##############################################################################

